INSERT INTO common_scheduling_production_order
(name, mps_id, remarks, confirmed, closed, start_date_time, end_date_time, production_quantity, process_id, workcenter_id, actual_start_date_time, actual_end_date_time, actual_production_quantity, workers, actual_workers)
VALUES
    ('브레이크 디스크 양산 작업', 1, '브레이크 디스크 양산 작업 진행', true, true, '2024-10-21 08:00:00', '2024-10-21 17:00:00', 500, 1, 1, '2024-10-21 08:00:00', '2024-10-21 17:00:00', 500, 10, 10),
    ('연료 펌프 시험 작업', 2, '연료 펌프 시험 양산 작업', true, true, '2024-10-21 08:00:00', '2024-10-21 17:00:00', 300, 2, 2, '2024-10-21 08:30:00', '2024-10-21 18:00:00', 350, 8, 8),
    ('브레이크 패드 긴급 작업', 3, '긴급 브레이크 패드 작업 진행', true, true, '2024-10-21 08:00:00', '2024-10-21 17:00:00', 200, 3, 3, '2024-10-21 08:00:00', '2024-10-21 17:00:00', 200, 5, 5),
    ('냉각 팬 샘플 제작 작업', 4, '냉각 팬 샘플 제작', true, true, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 50, 4, 4, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 50, 4, 4),
    ('쇼크 업소버 프로젝트 작업', 5, '쇼크 업소버 프로젝트 작업 진행', true, true, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 400, 5, 5, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 400, 12, 12),
    ('에어 필터 양산 작업', 6, '에어 필터 양산 완료', true, true, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 600, 6, 6, '2024-10-22 08:00:00', '2024-10-22 17:00:00', 600, 15, 15),
    ('알터네이터 긴급 작업', 7, '알터네이터 긴급 생산 작업 진행', true, true, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 300, 7, 7, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 300, 7, 7),
    ('배기 머플러 샘플 작업', 8, '배기 머플러 샘플 제작 진행', true, true, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 100, 8, 8, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 100, 6, 6),
    ('스티어링 휠 프로젝트 작업', 9, '스티어링 휠 프로젝트 작업 진행', true, true, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 350, 9, 9, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 350, 9, 9),
    ('연료 펌프 추가 양산 작업', 10, '연료 펌프 추가 양산 작업 진행', true, true, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 700, 10, 10, '2024-10-23 08:00:00', '2024-10-23 17:00:00', 700, 20, 20);
