-- 은행 주소 정보 테이블
INSERT INTO financial_address (id, postal_code, road_address, detailed_address) VALUES
(1, '12345', '서울특별시 강남구 테헤란로 123', '20층'),
(2, '54321', '서울특별시 중구 을지로 456', '15층'),
(3, '67890', '서울특별시 서초구 서초대로 789', '10층'),
(4, '09876', '서울특별시 종로구 종로 101', '5층'),
(5, '13579', '서울특별시 영등포구 여의대로 202', '30층'),
(6, '97531', '서울특별시 마포구 마포대로 303', '25층'),
(7, '24680', '서울특별시 강북구 도봉로 404', '7층'),
(8, '86420', '서울특별시 동작구 동작대로 505', '12층'),
(9, '35791', '서울특별시 성동구 성수대로 606', '22층'),
(10, '15973', '서울특별시 광진구 광나루로 707', '17층');