
-- 호봉 데이터 삽입 (1호봉 ~ 10호봉)
INSERT INTO employee_salarystep (code, name, description) VALUES
                                                              ('1', '1호봉', '1호봉 설명'),
                                                              ('2', '2호봉', '2호봉 설명'),
                                                              ('3', '3호봉', '3호봉 설명'),
                                                              ('4', '4호봉', '4호봉 설명'),
                                                              ('5', '5호봉', '5호봉 설명'),
                                                              ('6', '6호봉', '6호봉 설명'),
                                                              ('7', '7호봉', '7호봉 설명'),
                                                              ('8', '8호봉', '8호봉 설명'),
                                                              ('9', '9호봉', '9호봉 설명'),
                                                              ( '10', '10호봉', '10호봉 설명');
