
-- 호봉 데이터 삽입 (1호봉 ~ 10호봉)
INSERT INTO employee_salarystep (code, name, description) VALUES
                                                              ('1', '1호봉', ''),
                                                              ('2', '2호봉', ''),
                                                              ('3', '3호봉', ''),
                                                              ('4', '4호봉', ''),
                                                              ('5', '5호봉', ''),
                                                              ('6', '6호봉', ''),
                                                              ('7', '7호봉', ''),
                                                              ('8', '8호봉', ''),
                                                              ('9', '9호봉', ''),
                                                              ( '10', '10호봉', '');
