INSERT INTO salary_ledger_date (code, description) VALUES
                                                       ('1','01월 25일 정산'),
                                                       ('2','02월 25일 정산'),
                                                       ('3','03월 25일 정산'),
                                                       ('4','04월 25일 정산'),
                                                       ('5','05월 25일 정산'),
                                                       ('6','06월 25일 정산'),
                                                       ('7','07월 25일 정산'),
                                                       ('8','08월 25일 정산'),
                                                       ('9','09월 25일 정산'),
                                                       ('10','10월 25일 정산'),
                                                       ('11','11월 25일 정산'),
                                                       ('12','12월 25일 정산');