# INSERT INTO product_group (code, name, is_active) VALUES
# ('01', '가공식품', TRUE),
# ('02', '신선식품', TRUE),
# ('03', '일상용품', TRUE),
# ('05', '의약품/의료기기', TRUE),
# ('06', '교육/문화용품', TRUE),
# ('07', '디지털/가전', TRUE),
# ('08', '가구/인테리어', TRUE),
# ('09', '의류', TRUE),
# ('10', '전문스포츠/레저', TRUE),
# ('11', '패션잡화', TRUE),
# ('99', '기타', TRUE);

-- 자동차 관련 제품 그룹
INSERT INTO product_group (code, name, is_active) VALUES
('01', '엔진 부품', TRUE),
('02', '브레이크 시스템', TRUE),
('03', '연료 시스템', TRUE),
('04', '점화 시스템', TRUE),
('05', '에어컨 및 냉각 시스템', TRUE),
('06', '전기 시스템', TRUE),
('07', '서스펜션 및 조향 시스템', TRUE),
('08', '배기 시스템', TRUE),
('09', '차량 내부 액세서리', TRUE),
('10', '차량 외부 액세서리', TRUE),
('11', '디지털 및 소프트웨어', TRUE),
('99', '기타 자동차 부품', TRUE);
