-- 주소(Address) 테이블 초기 데이터
INSERT INTO company_address (business_postal_code, businesse_address, businesse_address_detail, is_businesse_new_address, businesse_place, headquarter_postal_code, headquarter_address, headquarter_address_detail, is_headquarter_new_address, headquarter_place) VALUES
('12345', '서울시 강남구 테헤란로 10', '101호', true, '강남구', '54321', '서울시 종로구 세종대로 100', '201호', true, '종로구'),
('67890', '서울시 서초구 반포대로 20', '202호', false, '서초구', '09876', '서울시 영등포구 여의대로 200', '102호', false, '영등포구'),
('34567', '서울시 마포구 마포대로 30', '303호', true, '마포구', '65432', '서울시 중구 소공로 300', '202호', true, '중구'),
('12346', '서울시 송파구 오금로 100', '101호', true, '송파구', '54322', '서울시 동작구 사당로 50', '301호', true, '동작구'),
('67891', '서울시 노원구 상계로 200', '202호', false, '노원구', '09877', '서울시 강북구 삼양로 150', '102호', false, '강북구'),
('34568', '서울시 성북구 고려대로 50', '303호', true, '성북구', '65433', '서울시 중랑구 면목로 70', '202호', true, '중랑구'),
('12347', '서울시 양천구 목동로 100', '101호', true, '양천구', '54323', '서울시 강서구 화곡로 60', '201호', true, '강서구'),
('67892', '서울시 영등포구 여의로 300', '202호', false, '영등포구', '09878', '서울시 구로구 구로동로 70', '102호', false, '구로구'),
('34569', '서울시 금천구 시흥대로 200', '303호', true, '금천구', '65434', '서울시 관악구 봉천로 50', '202호', true, '관악구'),
('12348', '서울시 서대문구 통일로 150', '101호', true, '서대문구', '54324', '서울시 은평구 연서로 80', '201호', true, '은평구');