-- ShiftType 데이터 삽입
INSERT INTO ShiftType (name, description, duration) VALUES
                                                        ('주간', '8시간 주간 근무', 8),
                                                        ('야간', '8시간 야간 근무', 8),
                                                        ('오전', '8시간 오전 근무', 8),
                                                        ('오후', '8시간 오후 근무', 8),
                                                        ('주간 12시간', '12시간 주간 근무', 12),
                                                        ('야간 12시간', '12시간 야간 근무', 12),
                                                        ('4조 3교대', '4개조 3교대 근무', 8),
                                                        ('3조 2교대', '3개조 2교대 근무', 12),
                                                        ('4조 2교대', '4개조 2교대 근무', 12);
